{"produtos":[[{"tipo":"PIC","nome":"Microcontrolador PIC 16F876A","valor":16.9,"estoque":"47","descricao":"Microcontrolador PIC16F876A Microchip 8 bits, de fácil programação e alta performance, indicado tanto para utilização em ambientes industriais e automotivos como também para pequenos projetos e automação residencial.","codigo":"7","avaliacao":"","carrinho":0},{"tipo":"PIC","nome":"Microcontrolador PIC 12F629","valor":7.9,"estoque":"39","descricao":"Microcontrolador PIC12F629 Microchip de 8 bits, de programação simples e alta performance, indicado para utilização em projetos industriais, automotivos, prototipação e automação residencial, entre outros.","codigo":"0","avaliacao":"","carrinho":0},{"tipo":"PIC","nome":"Microcontrolador PIC 16F873A","valor":21.9,"estoque":"25","descricao":"Microcontrolador PIC16F873A Microchip de 8 bits, de programação simples e alta performance, indicado para utilização em projetos industriais, automotivos, prototipação e automação residencial, entre outros.","codigo":"6","avaliacao":"","carrinho":0},{"tipo":"PIC","nome":"Microcontrolador PIC 16F84A","valor":22.9,"estoque":"10","descricao":"Poderoso Microcontrolador PIC16F84A Microchip 8 bits, de fácil programação, indicado para prototipação ou projetos finais. Permite a programação via ICSP e é facilmente adaptável à circuitos que necessitem de baixo consumo de energia, como sistemas remotos e projetos na área de segurança.","codigo":"8","avaliacao":"","carrinho":0},{"tipo":"PIC","nome":"Microcontrolador PIC 16F676","valor":8.9,"estoque":"1","descricao":"Microcontrolador PIC16F676 Microchip de 8 bits, de programação simples e alta performance, indicado para utilização em projetos industriais, automotivos, prototipação e automação residencial, entre outros.","codigo":"3","avaliacao":"","carrinho":0},{"tipo":"PIC","nome":"Microcontrolador PIC 18F4550","valor":44.9,"estoque":"0","descricao":"Este é o poderoso e conectável Microcontrolador PIC 18F4550 da Microchip. Acompanha diversas portas de comunicação, inclusive USB 2.0 com (12Mbit/s).","codigo":"5","avaliacao":"","carrinho":0},{"tipo":"PIC","nome":"Microcontrolador PIC 16F630","valor":12.9,"estoque":"14","descricao":"Microcontrolador PIC16F630 Microchip 8 bits, de fácil programação e alta performance, indicado tanto para utilização em ambientes industriais e automotivos como também para pequenos projetos e automação residencial.","codigo":"2","avaliacao":"","carrinho":0},{"tipo":"PIC","nome":"Microcontrolador PIC 16F877A","valor":26.9,"estoque":"17","descricao":"Este é o poderoso e fácil de se programar Microcontrolador PIC 16F877A da Microchip.","codigo":"4","avaliacao":"","carrinho":0},{"tipo":"PIC","nome":"Microcontrolador PIC 16F628A","valor":14.9,"estoque":"12","descricao":"Este é o compacto e completo Microcontrolador PIC16F628A da Microchip.","codigo":"1","avaliacao":"","carrinho":1}],[{"tipo":"SENSOR","nome":"Sensor de Frequência Cardíaca","valor":34.9,"estoque":"89","descricao":"Os dados de frequência cardíaca podem ser muito úteis quando você está montando uma rotina de exercícios, estudando sua atividade física diária ou mesmo para fins didáticos. O sensor de pulso monitor cardíaco efetua a leitura das batidas do coração usando um sensor óptico amplificado, e envia esses dados para o microcontrolador como o Arduino através de um único pino de sinal. Devido ao baixo consumo de energia (4mA), é indicado para projetos embarcados e wearables.","codigo":"18","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Sensor Termopar Tipo K Temperatura -50 a 650°C","valor":9.9,"estoque":"129","descricao":"Termopar Tipo K com faixa de medição de -50 à 650°C, para utilização em equipamentos de medição e multímetros. Utilização em medida de temperatura de superfícies, ar e gás.","codigo":"23","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Sensor de Corrente Não Invasivo 20A SCT-013","valor":49.9,"estoque":"43","descricao":"O sensor de corrente SCT-013-020 é uma ótima opção se você está buscando um equipamento para medir corrente até 20A e que não seja invasivo. Muito usado em projetos para monitoramento de corrente, proteção de motores AC, iluminação e dentre outros.","codigo":"15","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Kit de Sensores x16 unidades","valor":159.9,"estoque":"7","descricao":"Com este kit de sensores de 16 peças você tem diversos componentes para começar o seu projeto, ao mesmo tempo em que economiza adquirindo vários sensores no mesmo pacote. O kit é composto por sensor de temperatura, sensor infravermelho, RTC, sensor de chuva, sensor ultrassônico, sensor de chama, módulo laser, sensor de umidade do solo, sensor de som, módulo sensor de luz LDR, sensor de obstáculo, sensor de choque, transceiver 315MHz, sensor de gás, sensor tilt e sensor ótico TCRT5000. Os sensores e componentes podem tanto ser usados com Arduino como com Raspberry Pi, Cubieboard, Beaglebone e outras placas do mercado (observe a tensão de nível de sinal de cada um dos sensores). Para mais detalhes e exemplos de utilização dos componentes, verifique os links dos itens abaixo:","codigo":"20","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Módulo Receptor Infravermelho IR KY-022","valor":8.9,"estoque":"33","descricao":"Módulo receptor infravermelho modelo KY-022 para utilização em projetos eletrônicos, sistemas de controle remoto por IR, alarmes e outras aplicações. O módulo contém um receptor IR 1838 que funciona com tensões entre 2,7 e 5,5V comunicando-se com o microcontrolador por meio de um único pino de sinal.","codigo":"24","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Sensor de Umidade e Temperatura AM2302","valor":36.9,"estoque":"21","descricao":"O DHT22 é um sensor de temperatura e umidade que permite fazer leituras de temperaturas entre -40 a +80 graus Celsius e umidade entre 0 a 100%, sendo muito fácil de usar com Arduino, Raspberry e outros microcontroladores pois possui apenas 1 pino com saída digital. Este sensor AM2302 é compatível com os modelos DHT22/AM2303 e é formado por um sensor de umidade capacitivo e um termistor para medir o ar ao redor, enviando no pino de dados um sinal digital (não é necessário pinos analógicos aqui).","codigo":"13","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Sensor de Umidade e Temperatura DHT11","valor":10.9,"estoque":"35","descricao":"O DHT11 é um sensor de temperatura e umidade que permite fazer leituras de temperaturas entre 0 a 50 Celsius e umidade entre 20 a 90%, muito usado para projetos com Arduino. O elemento sensor de temperatura é um termistor do tipo NTC e o sensor de Umidade é do tipo HR202, o circuito interno faz a leitura dos sensores e se comunica a um microcontrolador através de um sinal serial de uma via. Confira a pinagem nas imagens.","codigo":"12","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Sensor de Distância Ultrassônico HC-SR04","valor":9.9,"estoque":"7","descricao":"O Sensor ultrassônico HC-SR04 é capaz de medir distâncias de 2cm a 4m com ótima precisão e baixo preço. Este módulo possui um circuito pronto com emissor e receptor acoplados e 4 pinos (VCC, Trigger, ECHO, GND) para medição. Você ainda pode acoplar este sensor neste suporte para sensor ultrassônico, facilitando a prototipagem do seu projeto.","codigo":"9","pos":0,"avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Sensor de Gás MQ-2 Inflamável e Fumaça","valor":16.9,"estoque":"46","descricao":"Este sensor de gás inflamável e fumaça MQ-2 é capaz de detectar concentrações de gases combustíveis e fumaça no ar. Um módulo confiável e simples de usar em seus projetos de automação residencial com Arduino por exemplo. Quando a concentração de gases fica acima do nível ajustado pelo potenciômetro, a saída digital D0 fica em estado alto, se abaixo do nível, fica em estado baixo. Uma ótima opção para acionar um microcontrolador ou relés. Para ter uma resolução melhor e medir a variação da concentração dos gases no ar é possível usar a saída analógica A0 e conectar a um conversor AD, como a presente no Arduino e Raspberry Pi por exemplo.","codigo":"14","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Sensor de Fluxo de Água 1/2 YF-S201","valor":34.9,"estoque":"20","descricao":"Medir fluxo de água para seus projetos eletrônicos agora não é mais um problema com este Sensor de Fluxo de Água YF-S201. Ele é instalado em linha com o cano para medir a quantidade de água que circula por ele, enviando pulsos PWM para seu Arduino ou Raspberry Pi por exemplo. Seu funcionamento é bem simples, em sua estrutura há um válvula em formato de catavento com um imã acoplado que trabalha em conjunto com um sensor hall para enviar um sinal PWM. Através destes pulsos é possível mensurar a vazão de água, sendo que cada pulso mede aproximadamente 2,25mm. Confira esta biblioteca para conexão com um Arduino.","codigo":"17","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Módulo Sensor IR 5 Canais para Robô","valor":44.9,"estoque":"13","descricao":"Com o módulo sensor IR 5 canais você tem um excelente componente para a montagem do seu robô, com 6 sensores IR e 1 switch, para você montar um robô anti-colisão, seguidor de linha ou qualquer outra configuração necessária ao seu projeto. São 5 sensores IR na parte de baixo do sensor, 1 na parte dianteira e 1 switch, que você pode usar para desligar o robô, por exemplo, quando ele tocar em algum obstáculo. O módulo tem ainda leds indicadores para cada um dos sensores, além do led Power (ligado).","codigo":"21","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Acelerômetro e Giroscópio 3 Eixos","valor":22.9,"estoque":"78","descricao":"O sensor MPU-6050 contém em um único chip um acelerômetro e um giroscópio tipo MEMS. São 3 eixos para o acelerômetro e 3 eixos para o giroscópio, sendo ao todo 6 graus de liberdade (6DOF). Não bastasse isso esta placa GY-521 tem um sensor de temperatura embutido no CI MPU6050, permitindo medições entre -40 e +85 ºC. Possui alta precisão devido ao conversor analógico digital de 16-bits para cada canal. Portanto o sensor captura os canais X, Y e Z ao mesmo tempo.","codigo":"10","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Sensor de Corrente Não Invasivo 100A SCT-013","valor":49.9,"estoque":"2","descricao":"O sensor de corrente SCT-013-000 é uma ótima opção se você está buscando um equipamento para medir corrente até 100A e que não seja invasivo. Muito usado em projetos com Arduino de automação residencial como medidores de corrente elétrica, proteção de motores AC, iluminação e dentre outros.","codigo":"16","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Acelerômetro e Giroscópio 9 Eixos","valor":89.9,"estoque":"6","descricao":"Dois módulos em um só! Esse é o módulo MPU9250, que conta também com um sensor de pressão BMP180, reduzindo o custo do seu projeto e facilitando a conexão, pois o módulo usa a interface I2C para se comunicar com o microcontrolador. O MPU9250 é um chip que tem um acelerômetro de 3 eixos, um giroscópio de 3 eixos e magnetômetro (sensor de campo magnético), também de 3 eixos. Aliado ao sensor de pressão BMP180, que se caracteriza pelo baixo consumo de energia, você tem um módulo com 10DOF (Degrees of Freedom), tudo isso em uma minúscula placa.","codigo":"11","avaliacao":"","carrinho":0},{"tipo":"SENSOR","nome":"Joystick Para Arduino 3 Eixos","valor":12.9,"estoque":"24","descricao":"Este Joystick tem seu princípio de funcionamento através do controle de 2 potenciômetros e um botão. Duas das entradas dos potenciômetros referem-se aos eixos X e Y, sendo que o botão quando pressionado refere-se ao eixo Z. Logo este Joystick contém o total de três interfaces de entradas que são utilizadas para conectar ao eixo X, Y e Z. Este modelo com menos pinos torna-se uma ótima opção para projetos com Arduino pois evita muitas conexões, podendo ser usado como mouse, controle de robôs, games, joystick ps2 e projetos em geral. Confira alguns projetos na seção Blog abaixo!","codigo":"19","avaliacao":"","carrinho":1},{"tipo":"SENSOR","nome":"Sensor de Proximidade Indutivo NPN 6-36V","valor":26.9,"estoque":"90","descricao":"O Sensor de Proximidade Indutivo NPN é um sensor capaz de detectar objetos metálicos a até 4mm de distância e gerar um sinal na saída do sensor, que pode ser lido por um microcontrolador como Arduino. O sensor indutivo por ser utilizado em máquinas, contadores, impressoras 3D, como chave de fim de curso, alarmes e outras aplicações.","codigo":"22","avaliacao":"","carrinho":1}],[{"tipo":"COMPONENTE","nome":"Kit LED 3mm 5mm x300 unidades 5 Cores","valor":26.9,"estoque":"42","descricao":"Kit de leds 3mm e 5mm para utilização em circuitos eletrônicos, brinquedos, prototipagem e projetos em geral. O kit contém 300 peças, com 30 leds de cada tamanho, em 5 cores diferentes. Acompanha caixa organizadora.","codigo":"25","avaliacao":"","carrinho":"0"},{"tipo":"COMPONENTE","nome":"Kit Capacitor Eletrolitico x200 unidades 15 Valores","valor":29.9,"estoque":"34","descricao":"Kit de capacitores eletrolíticos com 200 peças para utilização em projetos eletrônicos, como peça de reposição e prototipagem. São 200 peças com 15 valores diferentes, acondicionados em uma prática caixa organizadora.","codigo":"26","avaliacao":"","carrinho":"0"},{"tipo":"COMPONENTE","nome":"Kit Capacitor Cerâmico x300 unidades 15 Valores","valor":36.9,"estoque":"25","descricao":"Kit de capacitores cerâmicos de alta tensão para utilização em projetos eletrônicos e como peça de reposição. São 300 peças com 15 valores diferentes, acondicionados em uma prática caixa organizadora. Os capacitores tem tolerância de 10%.","codigo":"27","avaliacao":"","carrinho":"0"},{"tipo":"COMPONENTE","nome":"Kit Transistor TO-92 x600 Unidades","valor":49.9,"estoque":"50","descricao":"O kit de transistores contém 600 peças de transistores de uso geral e encapsulamento TO-92 para utilização como peça de reposição e montagem de circuitos eletrônicos. São 15 valores diferentes e 40 unidades de cada transistor. Consulte a tabela abaixo para conferir os modelos e especificações. Acompanha caixa organizadora.","codigo":"28","avaliacao":"","carrinho":"0"},{"tipo":"COMPONENTE","nome":"Relé 5V Sanyou SRD-S-105D","valor":3.9,"estoque":"98","descricao":"Este relé é um componente básico em quase todo projeto que envolva acionamentos de dispositivos, como acionar uma lâmpada 220V com Arduino por exemplo. A sua tensão de operação é de 5VDC e suporta até 7A para tensões alternadas de até 250V.","codigo":"31","avaliacao":"","carrinho":"0"},{"tipo":"COMPONENTE","nome":"Kit Push Button com Capas Coloridas x50","valor":34.9,"estoque":"29","descricao":"Kit de chaves tipo push button com capas coloridas, para utilização em projetos eletrônicos em geral como fliperamas, videogames, controle de jogos, etc. Com capas em 7 cores diferentes, permite uma enorme variedade de combinações para incremantar o visual do seu projeto!","codigo":"30","avaliacao":"","carrinho":0},{"tipo":"COMPONENTE","nome":"Kit Potenciômetro Trimmer x50 Unidades","valor":59.9,"estoque":"79","descricao":"Kit de Potenciômetro Trimmer multivoltas de uso geral para utilização em circuitos eletrônicos. Modelo 3296W. O kit contém 5 peças de cada valor de trimmer, totalizando 50 peças. Acompanha caixa organizadora.","codigo":"29","avaliacao":"","carrinho":0}],[{"tipo":"DISPLAY","nome":"Display LCD 16x2 Backlight Azul","valor":16.9,"estoque":"57","descricao":"Se você quer economizar e ainda assim ter um ótimo produto em mãos, acertou em cheio no produto. São 16 colunas por 2 linhas, backlight azul e escrita branca. Possui o controlador HD44780 usado em toda indústria de LCD's como base de interface. A interface com Arduino é muito simples, sendo basicamente 4 pinos de dados e 2 de controle. Confira no link o Datasheet Display LCD 16x2.","codigo":"32","avaliacao":"","carrinho":"0"},{"tipo":"DISPLAY","nome":"Display LCD 16x2 Backlight Verde","valor":18.9,"estoque":"22","descricao":"Display LCD 16x2 com backlight (luz de fundo) verde para utilização em equipamentos eletrônicos. Possui 2 linhas com 16 colunas e controlador HD44780. Este display é muito utilizado nos mais variados equipamentos eletrônicos como copiadoras, impressoras laser, impressoras 3d e equipamentos industriais, podendo também ser usado com placas como Arduino, Raspberry Pi e Cubieboard.","codigo":"33","avaliacao":"","carrinho":"0"},{"tipo":"DISPLAY","nome":"Display Lcd Gráfico 128x64 Backlight Azul","valor":69.9,"estoque":"19","descricao":"Display LCD gráfico 128x64 (128 colunas por 64 linhas) com backlight azul e escrita branca. Este LCD possui o controlador ST7920.","codigo":"35","avaliacao":"","carrinho":"0"},{"tipo":"DISPLAY","nome":"Display LCD - Nokia B - 5110","valor":24.9,"estoque":"43","descricao":"Este é um display com ótima relação custo x benefício para o seu projeto, pois se trata de um display gráfico monocromático com resolução de 84x48 pixels, e com ele você pode ter em uma mesma tela gráficos e textos. O Display LCD Nokia 5110 vem com espaço para conectores tanto na parte superior quanto na parte inferior, permitindo que você solde a barra de pinos na posição que achar mais conveniente para o seu projeto. Atenção para alimentação do display, que é de 3.3V. Quanto ao nível de sinal dos pinos de dados, o display é tolerante à 5V assim você pode utilizar sem problemas, por exemplo, com um Arduino Uno.","codigo":"36","avaliacao":"","carrinho":"0"},{"tipo":"DISPLAY","nome":"Display Cubiescreen TFT 3.5' para Cubieboard","valor":299.9,"estoque":"15","descricao":"Display TFT touch para Cubieboard 1 e 2, com touch capacitivo e resolução de 800x480. Encaixa diretamente na placa Cubieboard, sem a necessidade de cabos ou alimentação extra. CubieScreen oferece muitas interfaces de comunicação através de seus GPIOS como: Câmara ou DVB TS, SDIO, saída CVBS, Áudio ADC e GPIOs.","codigo":"37","avaliacao":"","carrinho":"0"},{"tipo":"DISPLAY","nome":"Painel de LED RGB de 32x32","valor":299.9,"estoque":"3","descricao":"Crie efeitos visuais incríveis para o seu projeto com o Painel de led RGB 32x32. Com 1024 leds RGB, você cria os mais variados efeitos visuais, animações e jogos. E se apenas um painel não for suficiente, você pode interligar vários deles em cascata. Este painel exige uma fonte de alimentação regulada de 3,3 à 5V com capacidade de pelo menos 2A. Veja na seção de downloads um tutorial de como interligar esse painel ao Arduino.","codigo":"39","avaliacao":"","carrinho":"0"},{"tipo":"DISPLAY","nome":"Display LCD TFT 1.8' 128x160","valor":49.9,"estoque":"40","descricao":"Adicione cor e movimento ao seu projeto com o Display LCD TFT 1.8', com resolução de 128x160 pixels e interface de comunicação SPI, permitindo que você crie animações, gráficos, texto e muito mais! O display tem também um slot para cartão micro SD, onde você pode armazenar dados e imagens para mostrar na tela.  O display LCD TFT 1.8' usa interface SPI para comunicação, e pode ser utilizado não só com Arduino, mas também com placas como Raspberry, Beaglebone, módulos ESP8266, etc.","codigo":"41","avaliacao":"","carrinho":"0"},{"tipo":"DISPLAY","nome":"Display LCD TFT Touch 3.5' Raspberry Pi","valor":299.9,"estoque":"4","descricao":"Tenha mais mobilidade no seu projeto com Raspberry Pi utilizando o Display LCD TFT Touch de 3,5 polegadas com resolução de 320x480 pixels. Você pode encaixar esse display diretamente no seu Raspberry Pi graças ao conector de 26 pinos, e utilizar os pinos restantes para ligação de sensores, motores, módulos e outros dispositivos. Com esse display você ainda libera as portas USB do Raspberry, pois as funções de mouse e teclado podem ser usadas no próprio display. Este modelo é compatível com os modelos Raspberry Pi 2 e B+.","codigo":"41","avaliacao":"","carrinho":"0"},{"tipo":"DISPLAY","nome":"Display LCD 20x4 Backlight Azul","valor":44.9,"estoque":"31","descricao":"Display LCD 20x4 (20 colunas por 4 linhas) com backlight azul e escrita branca é usado em toda indústria e em projetos eletrônicos com Arduino, Raspberry Pi e PIC, podendo ser operado em 4 ou 8-bits paralelamente.  Este display é uma ótima opção se você precisa exibir várias informações, que muitas vezes não cabem em um Display LCD 16x2. A ligação com Arduino é muito simples, feita basicamente com 4 pinos de dados e 2 de controle. Projetos com Arduino e este display estão na seção Blog.","codigo":"34","avaliacao":"","carrinho":0},{"tipo":"DISPLAY","nome":"Display Touchscreen 7' Raspberry Pi","valor":590.9,"estoque":"7","descricao":"Crie projetos profissionais com o Raspberry Pi utilizando o Display TFT Touchscreen 7', um display de 7 polegadas com tela sensível ao toque e resolução de 800x480 pixels. Com ele você pode dispensar o uso de teclado e mouse adicionais no seu projeto, criando um ambiente de excelente interação com o usuário. Tudo isso a um ótimo preço e envio para todo Brasil. O display é conectado à uma placa adaptadora, que se comunica com o Raspberry Pi utilizando o conector DSI (display), a alimentação (5V) pode ser feita pela própria GPIO do Raspberry, utilizando dois pinos.  O conjunto acompanha parafusos e espaçadores para que você possa montar tanto a placa adaptadora como o Raspberry na parte de trás do display, criando um ótimo layout para projetos embarcados, entretenimento e IoT (Internet of Things).","codigo":"38","avaliacao":"","carrinho":0}],[{"tipo":"CABO","nome":"Kit Jumpers Macho-Macho x65 Unidades","valor":16.9,"estoque":"277","descricao":"Conjunto de 65 Jumpers/Fios para Protoboard. Excelente para montagem de projetos eletrônicos com rapidez, agilidade e limpeza! Agora sua prototipagem ficou muito mais fácil.","codigo":"42","avaliacao":"","carrinho":"0"},{"tipo":"CABO","nome":"Jumpers Fêmea-Fêmea x40 Unidades","valor":12.9,"estoque":"409","descricao":"Conjunto com 40 Jumpers conexão tipo Fêmea-Fêmea. Excelente para montagem de projetos com rapidez, agilidade e limpeza! Os jumpers vem grudados uns aos outros, mas podem ser destacados para serem usados na quantidade certa, dessa forma dispensa o uso de prensa cabos e você tem mais organização na sua montagem.","codigo":"43","avaliacao":"","carrinho":"0"},{"tipo":"CABO","nome":"Jumpers Macho-Fêmea x40 Unidades","valor":16.9,"estoque":"409","descricao":"Conjunto com 40 Jumpers conexão tipo Macho-Fêmea. Excelente para montagem de projetos em protoboard com rapidez, agilidade e limpeza! Os jumpers vem grudados uns aos outros, mas podem ser destacados para serem usados na quantidade certa, dessa forma dispensa o uso de prensa cabos e você tem mais organização na sua montagem.","codigo":"44","avaliacao":"","carrinho":"0"},{"tipo":"CABO","nome":"Jumpers Macho-Macho x40 Unidades","valor":16.9,"estoque":"327","descricao":"Conjunto com 40 jumpers com conexão macho-macho para montagem de projetos em protoboard e prototipagem. Os jumpers vem grudados uns aos outros e vc pode destacar e usar na quantidade que precisar, deixando o seu circuito mais limpo e organizado.","codigo":"45","avaliacao":"","carrinho":"0"},{"tipo":"CABO","nome":"Cabo Garra Jacaré x10 Unidades","valor":19.9,"estoque":"104","descricao":"Conjunto de 10 cabos com ponta tipo Jacaré para facilitar sua montagem, é simples basta apertar e agarrar o terminal que deseja o contato. Muito simples e prático para testes e em projetos em fase de desenvolvimento.","codigo":"47","avaliacao":"","carrinho":"0"},{"tipo":"CABO","nome":"Cabo Conversor USB TTL PL-2303HX","valor":24.9,"estoque":"18","descricao":"Utilize o cabo conversor USB-TTL PL-2303HX para comunicação entre o computador e dispositivos eletrônicos que utilizam comunicação serial RS232. Ao instalar o cabo, é criada uma porta serial (COM), no computador, permitindo que você utilize o software de comunicação de sua preferência. OBS: O cabo é indicado para dispositivos que trabalham com 5V, mas você pode abrir o conector USB, retirar o fio vermelho do pino 5V e soldar no pino 3.3. Assim, pode utilizar o cabo em dispositivos que trabalham com 3.3V.","codigo":"48","avaliacao":"","carrinho":"0"},{"tipo":"CABO","nome":"Cabo HDMI v1.3 1,8m Multilaser","valor":16.9,"estoque":"12","descricao":"Agora com este cabo HDMI você poderá conectar o seu Raspberry Pi a um monitor de vídeo com entrada HDMI sem complicações. Transfira áudio e vídeo com alta definição, graças à sua confecção robusta e aos conectores banhados à ouro.","codigo":"49","avaliacao":"","carrinho":"0"},{"tipo":"CABO","nome":"Cabo Micro USB 1,2m Multilaser","valor":14.9,"estoque":"29","descricao":"Cabo de comunicação micro USB para conexão do seu smartphone, câmera digital, tablet, Arduino, Raspberry e outros dispositivos. Ideal para programação e transferência de dados entre o computador e dispositivos com conexão micro USB.","codigo":"50","avaliacao":"","carrinho":"0"},{"tipo":"CABO","nome":"Kit Jumpers Rígido x140 Unidades","valor":24.9,"estoque":"92","descricao":"Kit de jumpers rígidos para prototipagem, em caixa com 140 peças de diversos tamanhos, para uso em protoboards e circuitos eletrônicos em geral. Os fios são encapados com plástico e dobrados em formato de U, conforme imagens do anúncio. O kit vem com 140 jumpers em cores variadas.","codigo":"46","avaliacao":"","carrinho":0}],[{"tipo":"MOTOR","nome":"Motor de Vibração 1027","valor":9.9,"estoque":"76","descricao":"Já fazia um tempo que queríamos trazer este produto para a Biguibi Componentes Eletrônicos, pois sabemos que ele pode ser usado em diversas aplicações super interessantes. Não sei se você já percebeu, mas este motor é aquele que faz o efeito de vibração em celulares, o vibracall. Este micro motor de vibração já possui fios para você conectar no seu protoboard ou na sua placa e ainda uma superfície adesiva para você colar. Possui um formato achatado e circular, facilitando o encaixe em aplicações wearables também.","codigo":"52","avaliacao":"","carrinho":"0"},{"tipo":"MOTOR","nome":"Motor de Passo 3-20V NEMA 17 Impressora 3D","valor":89.9,"estoque":"29","descricao":"Pra quem procura um motor de passo mais robusto encontrou o que precisava. Este motor de passo NEMA 17 é muito recomendado para impressoras 3D universais como Makerb/Reprap devido suas especificações. Com um ótimo custo benefício este motor tem um alto torque e ângulo de passo de apenas 1,8 graus. Confira também este kit acoplador para este motor e faça uma montagem mais robusta e confiável.","codigo":"53","avaliacao":"","carrinho":"0"},{"tipo":"MOTOR","nome":"Motor DC 3-6V com Caixa de Redução e Eixo Duplo","valor":16.9,"estoque":"56","descricao":"Motor DC 3-6V com caixa de redução e eixo duplo. Ideal para projetos com Arduino e construção de Robôs, como por exemplo Robô seguidor de linha.","codigo":"54","avaliacao":"","carrinho":"0"},{"tipo":"MOTOR","nome":"Motor Solar Mini 300 3-5V","valor":7.9,"estoque":"92","descricao":"Motor DC com tensão de alimentação de 3 à 5VDC, para utilização em projetos eletrônicos, robôs, automação e outras aplicações. Pode ser usado como peça de reposição em aparelhos de DVD e brinquedos, por exemplo.","codigo":"55","avaliacao":"","carrinho":"0"},{"tipo":"MOTOR","nome":"Motor DC 6V com Encoder 100/210/300 RPM","valor":99.9,"estoque":"4","descricao":"O motor DC 6V é um ótimo componente para o seu projeto, pois permite medir com exatidão a distância percorrida pelo motor, já que ele conta com um encoder integrado à carcaça. Perfeito para você montar seu robô segue faixa, autônomo e controlar distâncias percorridas com o encoder.","codigo":"56","avaliacao":"","carrinho":"0"},{"tipo":"MOTOR","nome":"Motor DC 6V 210RPM com Encoder e Adaptador","valor":129.9,"estoque":"9","descricao":"Com este motor DC 6V você tem todos os componentes para controlar os movimentos necessários ao seu projeto, já que ele conta com sensores no próprio motor. Funciona com tensão de 6VDC e acompanha roda e suporte para montagem. Perfeito para você montar seu robô segue faixa, autônomo e controlar distâncias percorridas com o encoder.","codigo":"57","avaliacao":"","carrinho":"0"},{"tipo":"MOTOR","nome":"Motor DC 12V 100RPM com Caixa de Redução","valor":39.9,"estoque":"78","descricao":"Motor DC 12V e velocidade de 100 RPM, para utilização em circuitos eletrõnicos, projetos de automação, robôs ou como peça de reposição. Possui alto torque e aceita alimentação entre 6 e 12V DC. Engrenagens em metal.","codigo":"58","avaliacao":"","carrinho":"0"},{"tipo":"MOTOR","nome":"Motor de Passo + Driver Uln2003 Arduino","valor":19.9,"estoque":"94","descricao":"Este Motor de Passo é o mais vendido na Guibigui Componentes Eletrônicos e trata-se de um modelo clássico, muitíssimo usado em projetos com Arduino. Você vai encontrar vários projetos e tutoriais com este motor, confira os links abaixo na seção Blog e entenda melhor seu funcionamento. O motor de passo 28BYJ-48 possui ótimo torque, unipolar, alimentação de 5V e redução de 1/64, isto significa que é possível dar uma volta completa com 4096 passos, ou seja, apenas ~0,088° por passo. Não bastasse isso, este motor de passo acompanha o driver ULN2003, um driver de corrente que permite o Arduino controlar motores com correntes superiores a 50mA, neste caso até 500mA. Este módulo possui LEDs que indicam o acionamento das bobinas e opera com tensões de 5-12V.","codigo":"59","avaliacao":"","carrinho":"0"},{"tipo":"MOTOR","nome":"Motor Brushless Emax CF2822 1200KV","valor":79.9,"estoque":"25","descricao":"Os motores E-MAX como este CF2822 oferecem uma eficácia extremamente elevada com alta capacidade de carga para o seu pequeno peso de 39g. São livres de manutenção e tem uma vida útil muito longa.  O grande diferencial destes motores é sua concepção construtiva, onde o componente rotativo ao qual é ligado à hélice não é o eixo central mas sim, a parte externa no motor. Graças a este recurso, o motor ganha muito mais torque, podendo, desta maneira, girar hélices mais pesadas sem a necessidade de nenhuma redução mecânica, minimizando as perdas por atrito, eliminando peças móveis que podem desgastar-se e, o mais importante, tornando seu aeromodelo muito mais leve, fator imprescindível para quem pratica o aeromodelismo elétrico.","codigo":"51","avaliacao":"","carrinho":0}],[{"tipo":"EMBARCADO","nome":"IoT Surfboard Globalcode 1","valor":599.9,"estoque":"18","descricao":"A IoT Surfboard é um placa completa com sensores, controladores e conectividade que facilita a exploração do conceito de IoT (Internet of Things, ou Internet das Coisas) permitindo o controle de dispositivos localmente ou através da rede. São 20 componentes em uma só placa e possibilidades de conexão para inúmeros outros dispositivos à sua escolha. Com a IoT Surfboard você pode aprender desde conceitos básicos de programação até desenvolver aplicações comerciais, ensinar eletrônica, desenvolver produtos, realizar projetos de automação residencial e industrial, entre outros. Confira a Página Oficial da IoT Surfboard com uma descricao detalhada e saiba tudo o que você será capaz de fazer!","codigo":"64","avaliacao":"","carrinho":0},{"tipo":"EMBARCADO","nome":"CubieBoard 2 A20 Dual-Card","valor":399.9,"estoque":"2","descricao":"A placa de desenvolvimento Cubieboard A20 Dual-card tem as mesmas características da placa Cubieboard 2, como processador Allwinner dual-core e conectores de expansão, exceto a memória NAND Flash onboard de 4GB. Por outro lado, possui 2 slots para cartão SD, aumentando as opções e a capacidade de armazenamento. A placa Cubieboard A20 suporta várias distribuições Linux e também sistema operacional Android. A porta SATA aceita disco rigido (HD) de até 2TB.","codigo":"62","avaliacao":"","carrinho":0},{"tipo":"EMBARCADO","nome":"Kit - Raspberry Pi - Starter*","valor":379.9,"estoque":"10","descricao":"O Kit Raspberry Pi Start tem tudo o que você precisa pra começar a criar seus próprios projetos utilizando o mais novo Raspberry Pi 3, a placa mais potente da linha Raspberry. Tudo isso a um ótimo preço e envio para todo o Brasil. O kit contém o material necessário para conectar a placa à um monitor com entrada HDMI, instalar o sistema operacional e também acessar a internet.  Confira na seção blog abaixo alguns tutoriais e projetos que vão ajudar você a explorar as funcionalidades do Kit Raspberry Pi Start.","codigo":"61","avaliacao":"","carrinho":0},{"tipo":"EMBARCADO","nome":"Kit Raspberry Pi Intermediate","valor":479.9,"estoque":"6","descricao":"O Kit Raspberry Pi Intermediate é indicado para usuários iniciantes ou avançados, que procuram um kit mais completo para criar seus projetos com Raspberry Pi 3. Além do material já presente no Kit Raspberry Start, no Kit Raspberry Pi Intermediate estão incluídos componentes eletrônicos como resistores, capacitores e leds, além de sensores e servo motor. Confira na seção blog abaixo alguns tutoriais e projetos que vão ajudar você a explorar as funcionalidades do Kit Raspberry Pi Intermediate. Acompanha: 01 - Raspberry Pi 3 Model B, 01 - Cartão de Memória 8GB MicroSd SanDisk com Adaptador, 01 - Fonte DC Chaveada 5V 3A Micro USB, 01 - Cabo HDMI v1.3 1,8m Multilaser, 01 - Case Raspberry Pi (Transparente, Branca ou Preta), 01 - Protoboard 400 Pontos, 40 - Jumpers Macho-Fêmea, 30 - Jumper Macho-Macho, 01 - Micro Servo 9g SG90 TowerPro, 01 - Sensor de Temperatura NTC, 01 - Sensor de Luz LDR, 01 - Sensor de Vibração Tilt, 01 - Buzzer Passivo, 01 - Barra de 40 Pinos, 10 - LED Vermelho, 10 - LED Verde, 01 - LED RGB, 10 - Capacitor Cerâmico 10nF, 10 - Capacitor Cerâmico 100nF, 05 - Capacitor Eletrolítico 100uF, 10 - Resistor 330Ω, 10 - Resistor 1KΩ, 10 - Resistor 10KΩ, 01 - Potenciômetro Trimpot 10KΩ, 05 - Chave Tactil, 05 - Chave 3 Posições, 01 - Caixa Plástica Transparente 15x9x4cm.","codigo":"60","avaliacao":"","carrinho":0},{"tipo":"EMBARCADO","nome":"CubieBoard 2 Allwinner A20","valor":465.9,"estoque":"0","descricao":"Esta é a nova placa CubieBoard 2, agora com o processador Allwinner A20, CPU dual-core e duas vezes mais performance de GPU. Tudo isso a um ótimo preço e envio para todo Brasil com Nota Fiscal. Em se tratando de software a placa está servida, suportando Android 4.2 Jelly Bean, Ubuntu 12.04 e outras distribuições Linux. Esta placa fabricada pela Cubietech é compatível com todos os produtos feitos para a Cubieboard 1 e também possui as mesmas dimensões, caso você queira substituir a sua placa antiga.","codigo":"66","avaliacao":"","carrinho":0},{"tipo":"EMBARCADO","nome":"Intel® Galileo Generation 2","valor":469.9,"estoque":"16","descricao":"RÉCEM CHEGOU: A placa Intel® Galileo Gen 2 acaba de ser lançada e é uma versão atualizada da Intel® Galileo Gen 1. Assim como a versão anterior esta placa também possui a certificação para Arduino, pois é baseada no processador Intel® Quark SoC X1000 e compatível com a pinagem padrão e software IDE da Arduino. Agora ficou fácil você comprar seu Intel® Galileo Gen 2 por um ótimo preço e com envio para todo o Brasil.","codigo":"65","avaliacao":"","carrinho":0},{"tipo":"EMBARCADO","nome":"Freescale Freedom FRDM-KL25Z","valor":149.9,"estoque":"22","descricao":"A placa de desenvolvimento Freescale Freedom FRDM-KL25Z é uma placa de baixo custo equipada com MCU KL25Z128 com core ARM Cortex M0+ com 128KB de memória flash e 16KB de memória SRAM, que pode rodar à 48MHz. Aqui na FilipeFlop você pode comprar a sua por um ótimo preço e envio para todo Brasil. A placa tem embutido um acelerômetro, led RGB, sensor touch e possiblidade de instalação de conectores para acesso à GPIO. Possui ainda 2 conectores mini USB para programação e alimentação. A FRDM-KL25Z tem o apoio de uma enorme gama de desenvolvedores de software NXP® e outras comunidades espalhadas pelo mundo.","codigo":"63","avaliacao":"","carrinho":0}]],"user":[{"id":10,"carrinho":[8,10,5,13],"quantidade":[5,11,15,4]}]}